LEVELS = [
    # Level 1：认识游戏
    [
        (0, 0, "left"),
        (1, 4, "down"),
        (4, 2, "left"),
        (5, 5, "up"),
    ],

    # Level 2：箭头数量增加
    [
        (1, 1, "right"),
        (1, 3, "right"),
        (1, 5, "right"),
        (5, 2, "up"),
        (3, 2, "up"),
        (6, 6, "right"),
    ],

    # Level 3：开始出现明显的先后顺序
    [
        (1, 1, "right"),
        (1, 3, "right"),
        (1, 5, "right"),
        (6, 2, "up"),
        (4, 2, "up"),
        (2, 2, "up"),
        (7, 7, "left"),
    ],

    # Level 4：多层阻挡
    [
        (1, 1, "right"),
        (1, 3, "right"),
        (1, 5, "right"),
        (1, 7, "right"),
        (6, 3, "up"),
        (4, 3, "up"),
        (2, 3, "up"),
        (7, 7, "left"),
    ],

    # Level 5：开始出现分散的阻挡关系
    [
        (7, 0, "right"),
        (3, 2, "left"),
        (5, 6, "down"),
        (5, 7, "left"),
        (6, 1, "up"),
        (2, 0, "right"),
        (3, 7, "left"),
        (6, 6, "left"),
        (3, 1, "left"),
    ],

    # Level 6：数量、多层阻挡、分散阻挡综合
    [
        (5, 4, "up"),
        (1, 1, "up"),
        (0, 0, "left"),
        (1, 4, "left"),
        (1, 5, "left"),
        (7, 2, "up"),
        (0, 1, "left"),
        (0, 5, "down"),
        (2, 2, "left"),
        (6, 1, "down"),
    ]
]